package com.autonavi.tbt;

public interface IFrameForTBT {
	/********************************************************************
	函数名称：netRequestHttp
	功能介绍：HTTP请求
	返 回 值：无
	说    明：此接口为异步接口，调用占用实现者的线程，函数调用必须立即返回
	********************************************************************/
	public void netRequestHttp(
		int moduleID,			    // [I] 模块号：1 请求路径，2 TMC，3 前方路况播报，4 情报看板，5 整体路况播报，6 路口扩大图
		int connectID,		        // [I] 连接ID，Frame请求到数据后用此ID将数据传给TBT
		int type,					// [I] 0为Post方式，1为Get方式
		String url,				    // [I] 请求的URL串
		String head,			    // [I] HTTP头，默认为空
		byte[] data,			    // [I] Post方式的Data数据，默认为空
		int dataLength		        // [I] Data数据长度，默认为空
		);

	/********************************************************************
	函数名称：updateNaviInfor
	功能介绍：更新导航信息，参见DGNaviInfor定义
	返 回 值：无
	说    明：无
	********************************************************************/
	public void updateNaviInfor(
		DGNaviInfor  dgNaviInfor		// [I] 导航信息
		);

	/********************************************************************
	函数名称：showCross
 	功能介绍：显示路口扩大图
 	返 回 值：无
	说    明：无
	********************************************************************/
	public void showCross(
		byte[] pCrossBackBuf,			 // [I] PNG格式的扩大图背景数据
		byte[] pCrossArrowBuf,           // [I] PNG格式的扩大图箭头数据
		int iBackSize,					 // [I] 背景数据大小
		int iArrowSize					 // [I] 箭头数据大小
		);
	/********************************************************************
	函数名称：hideCross
	功能介绍：隐藏路口扩大图
	返 回 值：无
	说    明：无
	********************************************************************/
	public void hideCross();
	
	/********************************************************************
	函数名称：ShowLaneInfo
 	功能介绍：显示车道信息
	返 回 值：无
	说    明：无
	********************************************************************/
	public void showLaneInfo(
		byte[] laneBackInfo,			// [I] 车道背景信息
		byte[] laneSelectInfo			// [I] 车道选择信息
		);

	/********************************************************************
	函数名称：hideLaneInfo
	功能介绍：隐藏车道信息
	返 回 值：无
	说    明：无
	********************************************************************/
	public void hideLaneInfo();

	/********************************************************************
	函数名称：playNaviSound
	功能介绍：使用TTS播报一个字符串
	返 回 值：无
	说    明：函数占用Frame的线程，此函数调用后马上返回
	********************************************************************/
	public void playNaviSound(
		int soundType,			// [I] 语音类型：1 导航播报，2 前方路况播报
		String soundStr			// [I] 要播报的字符串Unicode编码
		);
	
	/********************************************************************
	函数名称：endEmulatorNavi
	功能介绍：停止模拟导航
	返 回 值：无
	说    明：指引模拟导航结束后通知Frame以便更新UI界面等
	********************************************************************/
	public void endEmulatorNavi();

	/********************************************************************
	函数名称：arriveWay
	功能介绍：通知到达途经点或目的地
	返 回 值：无
	说    明：无
	********************************************************************/
	public void arriveWay(
		int wayId		// [I] 到达途径点的编号，标号从1开始，如果到达目的地iWayID为0
		);

	/********************************************************************
	函数名称：reroute
	功能介绍：通知Frame需要重新规划路径
	返 回 值：无
	说    明：无
	********************************************************************/
	public void reroute();
	
	/********************************************************************
	函数名称：rerouteForTMC
	功能介绍：TMC改变需要重算路径
	返 回 值：无
	说    明：无
	********************************************************************/
	public void rerouteForTMC();

	/********************************************************************
	函数名称：routeDestroy
	功能介绍：通知路径销毁
	返 回 值：无
	说    明：无
	********************************************************************/
	public void routeDestroy();
	
	/********************************************************************
	函数名称：carLocationChange
	功能介绍：通知当前匹配后的GPS位置点
	返 回 值：无
	说    明：
	********************************************************************/
	public void carLocationChange(
		CarLocation  carLocation			// [I] 当前匹配后的点，参见VPLocation结构
		);

	/********************************************************************
	函数名称：setRequestRouteState
	功能介绍：通知路径计算状态
	返 回 值：无
	说    明：requestRouteState含义如下
			1	路径计算成功
			2	网络超时
			3	网络失败
			4	请求参数错误
			5	返回数据格式错误
			6	起点周围没有道路
			7	起点在步行街
			8	终点周围没有道路
			9	终点在步行街
			10	途经点周围没有道路
			11	途经点在步行街
	********************************************************************/
	public void setRequestRouteState(
		int requestRouteState
		);

	/********************************************************************
	函数名称：tmcUpdate
	功能介绍：通知动态信息改变
	返 回 值：无
	说    明：动态更新后，需要更新光柱等
	********************************************************************/
	public void tmcUpdate();

	/********************************************************************
	函数名称：showTrafficPanel
	功能介绍：显示情报板
	返 回 值：无
	说    明：无
	********************************************************************/
	public void showTrafficPanel(
		int iSize,
		byte[] panelBuf			// [I] 情报板数据
		);

	/********************************************************************
	函数名称：hideTrafficPanel
	功能介绍：关闭情报板
	返 回 值：无
	说    明：无
	********************************************************************/
	public void hideTrafficPanel();
};



